Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བདག་ལ་ཕན་འདོགས་པའོ་ཞེས་དགའ་བ་བསྐྱེད་པས། བདུད་སྡིག་ཏོ་ཅན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་སེམས་ལ་ཞུམ་པ་མེད་པར་རིག་ནས། སའི་ཕྱོགས་དེ་ཉིད་དུ་དགེ་སློང་མང་པོ་མངོན་པར་སྤྲུལ་ཏེ་དགེ་སློང་འདི་དག་ཀུན་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འཇུག་འཇུག་པ་ཤ་སྟག་སྟེ། དེ་དག་ཀྱང་དགྲ་བཅོམ་པ་ཉིད་ལ་གནས་པར་གྱུར་ན། ཁྱོད་ལྟས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རེ་སྐན་ཞེས་ཟེར་ཡང་།
en: then the evil Māra, knowing that the minds of those bodhisattva great beings are not discouraged, would conjure up, in that very place, a multitude of monks, and say, ‘All of these monks have exclusively embarked on unsurpassed, complete enlightenment, but since they remain in the state of arhatship, how could you ever possibly attain consummate buddhahood in unsurpassed, complete enlightenment!’ “

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་འདི་སྙམ་སྟེ། འདི་ནི་བདུད་སྡིག་ཏོ་ཅན་ཏེ། ལམ་གྱི་གཟུགས་བརྙན་སྟོན་པའོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་། ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡང་མི་ལྟུང་ལ། དེ་ལས་ཀྱང་གོང་དུ་འདི་སྙམ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: If, even when this is said, those bodhisattva great beings think, ‘This is the evil Māra revealing an imitation of the path!’

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དེ་ལྟར་སྤྱོད་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་གནས་མེད།
en: and while practicing the perfection of wisdom, they do not turn back from unsurpassed, complete enlightenment and do not fall into the level of the śrāvakas or the level of the pratyekabuddhas—and if, in addition, they think, ‘It is impossible and inopportune that bodhisattva great beings who practice the perfection of generosity, who practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and who engage with [the attributes and goals], up to and including all-aspect omniscience, in that manner will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: སྐབས་མེད་དེ། དེ་ནི་གནས་མ་ཡིན་ནོ་སྙམ་ན། རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: That would be impossible!’—then, Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible. {

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Ki.

source: འདི་སྙམ་དུ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་ཇི་སྐད་དུ་བསྟན་པ་དེ་ལྟར་བསླབ་ལ། སྤྱོད་པ་དེ་དང་མ་བྲལ་ཞིང་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་འདི་དག་གིས་སྤྱོད་པ་དེ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཡོངས་སུ་མི་ཉམ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཡོངས་སུ་མི་ཉམ།
en: IV: 152} “Moreover, Subhūti, bodhisattva great beings who are irreversible, while practicing the perfection of wisdom, would think, ‘If, having trained as the tathāgatas have taught, one engages with it by not parting from that practice and focusing one’s attention on it with the perfections in mind, then there will be no degeneration from the perfection of generosity; and there will be no degeneration from the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: ནང་སྟོང་པ་ཉིད་ལས་ཡོངས་སུ་མི་ཉམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལས་ཡོངས་སུ་མི་ཉམ། དྲན་པ་ཉེ་བར་གཞག་པ་ལས་ཡོངས་སུ་མི་ཉམ། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལས་ཡོངས་སུ་མི་ཉམ།
en: There will be no degeneration from the emptiness of internal phenomena; there will be no degeneration from [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; and there will be no degeneration from the applications of mindfulness; there will be no degeneration from the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལས་ཡོངས་སུ་མི་ཉམ། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་།
en: There will be no degeneration from the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, or the formless absorptions.

source: སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལས་ཡོངས་སུ་མི་ཉམ།
en: There will be no degeneration from the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལས་ཡོངས་སུ་མི་ཉམ་མོ་སྙམ་ལ།
en: There will be no degeneration from [the goals], up to and including all-aspect omniscience.’ “

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་སྙམ་དུ་སུས་བདུད་ཀྱི་ལས་སུ་རིག་པ་དེ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཡོངས་སུ་མི་ཉམ་མོ་སྙམ་ན། རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Moreover, Subhūti, if bodhisattva great beings think, ‘Those who know the deeds of Māra will not degenerate from unsurpassed, complete enlightenment,’ then, Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible.”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཅི་ལས་སླར་ལྡོག་པའི་སླད་དུ། ཕྱིར་མི་ལྡོག་པ་ཞེས་བགྱི་བ་ལགས།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, turning away from what are bodhisattva great beings who are irreversible reckoned to be irreversible?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་གཟུགས་ཀྱི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: Subhūti,” replied the Blessed One, “they turn away from the notion of physical forms.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of feelings, perceptions, formative predispositions, and consciousness.

source: །སྐྱེ་མཆེད་ཀྱི་འདུ་ཤེས་དང་། ཁམས་ཀྱི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of the sense fields and the notion of the sensory elements.

source: །འདོད་ཆགས་ཀྱི་འདུ་ཤེས་དང་། ཞེ་སྡང་གི་འདུ་ཤེས་དང་། གཏི་མུག་གི་འདུ་ཤེས་དང་། ལྟ་བའི་རྣམ་པའི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of desire, the notion of hatred, the notion of delusion, and the notion of the [sixty-two] aspects of mistaken view.

source: །ཕ་རོལ་དུ་ཕྱིན་པའི་འདུ་ཤེས་དང་། སྟོང་པ་ཉིད་ཀྱི་འདུ་ཤེས་དང་། དྲན་པ་ཉེ་བར་གཞག་པའི་འདུ་ཤེས་དང་། ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་།
en: They turn away from the notion of the perfections, the notion of the aspects of emptiness, the notion of the applications of mindfulness, and the notions of the correct exertions, the supports for miraculous ability, the faculties, {Ki.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: IV: 153} the powers, the branches of enlightenment, and the noble eightfold path.

source: །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: །རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness.

source: །མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: །ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་གྱི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of [the goals], up to and including complete enlightenment.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of śrāvakas and pratyekabuddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་དང་སངས་རྒྱས་ཀྱི་འདུ་ཤེས་ལས་ཕྱིར་ལྡོག་གོ།
en: They turn away from the notion of bodhisattvas and buddhas.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་བས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་སྟེ།
en: If you ask why, it is because bodhisattva great beings who are irreversible have entered upon the maturity of the bodhisattvas in that all phenomena are empty of intrinsic defining characteristics.

source: དེས་ཆོས་རྡུལ་ཙམ་ཡང་དམིགས་པ་མེད་དོ། །དམིགས་པ་མེད་པས་མངོན་པར་འདུ་མི་བྱེད་དོ།
en: They do not apprehend anything at all, even to the extent of an indivisible atomic particle, and because they are without apprehending, they do not condition anything.

source: །མངོན་པར་འདུ་མི་བྱེད་པས་སྐྱེད་པ་མེད་དེ།
en: Because they do not condition anything, they do not produce anything.

source: དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་སྐྱེ་བ་ལ་བཟོད་པ་ཞེས་བྱ་སྟེ།
en: Bodhisattva great beings are said to have accepted that phenomena are nonarising.

source: རབ་འབྱོར་དེ་ལྟར་ན་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: Subhūti, you should know that bodhisattva great beings who possess these attributes, indications, and signs are irreversible.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་སུམ་ཅུ་དགུ་པའོ།། །།
en: This completes the thirty-ninth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་བདུད་སྡིག་ཏོ་ཅན་ཉེ་བར་འོངས་ཏེ་མོས་པ་ཟློག་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་འདི་ནི་ནམ་མཁའ་དང་མཚུངས་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའོ།
en: Chapter 40: Irreversibility “Moreover, Subhūti, the evil Māra might approach bodhisattva great beings and dissuade them, saying, ‘This all-aspect omniscience is similar to space, of the essential nature of nonentity, and empty of intrinsic defining characteristics.

source: །ཆོས་འདི་དག་ཀྱང་ནམ་མཁའ་དང་མཚུངས་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ། རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའོ།
en: These phenomena are also similar to space, of the essential nature of nonentity, and empty of intrinsic defining characteristics.

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་པ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ། རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། གང་ལ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བའི་ཆོས་དེ་དག་གང་ཡང་མི་དམིགས་ཏེ།
en: With regard to phenomena that are similar to space, of the essential nature of nonentity, and empty of intrinsic defining characteristics, there is nothing apprehensible that would attain consummate buddhahood, by which consummate buddhahood would be attained, and in which consummate buddhahood would be attained.

source: ཆོས་འདི་དག་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པས་འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ། །སྙམ་པའི་དེ་ན་ཁྱོད་ཉོན་མོངས་ལ་དོན་མེད་པར་འགྱུར་བ་སྟེ།
en: Since all these phenomena are similar to space, of the essential nature of nonentity, and empty of intrinsic defining characteristics, you will be disappointed and it would be futile to think that you will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: འདི་ནི་བདུད་ཀྱིས་བསྟན་པའོ། །འདི་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བཤད་པ་མ་ཡིན་ནོ།
en: This has been revealed by Māra, not explained by the completely awakened buddhas!

source: །རིགས་ཀྱི་བུ་ཡིད་ལ་བྱེད་པ་དེ་དག་ཐོང་ལ།
en: Noble child, you should reject these attentions!

source: ཁྱོད་ཡུན་རིང་པོར་གནོད་པ་དང་།
en: Do not endure hardships for long!

source: ཕན་པ་མེད་པར་མ་སྤྱོད་ཅིག །
en: Do not practice without benefit!

source: སྡུག་བསྔལ་བ་དང་། ལོག་པར་ལྟུང་ངོ་ཞེས་ཟེར་ན།
en: You will suffer and be distressed!’ “

source: དེ་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེས། ཚིག་དེ་དག་ཐོས་ནས་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། དེ་ལྟར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཟློག་པ་དེ་ནི་བདུད་ཀྱི་ལས་ཏེ།
en: If this is said, noble sons or noble daughters, on hearing those words, should reflect, ‘Those [words] that would avert me from unsurpassed, complete enlightenment are the work of Māra.

source: ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའ་དང་མཚུངས་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་མོད་ཀྱི། དེ་དག་སེམས་ཅན་རྣམས་ཀྱིས་མ་ཤེས་མ་མཐོང་།
en: Although all phenomena are indeed similar to space, of the essential nature of nonentity, and empty of intrinsic defining characteristics, they are not known, seen, or comprehended as such by beings.

source: ཁོང་དུ་མ་ཆུད་ཀྱིས་དེའི་ཕྱིར་བདག་གིས་ནམ་མཁའ་དང་མཚུངས་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་གོ་ཆ་བགོས་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱས་ལ། སེམས་ཅན་ཐམས་ཅད་ལ་འབྱུང་བའི་ཆོས་བསྟན་ཏོ།
en: Therefore, I should don the armor that is similar to space, of the essential nature of nonentity, and empty of intrinsic defining characteristics, attain consummate buddhahood in all-aspect omniscience, and reveal to all beings the Dharma of emancipation [from cyclic existence].

source: །སེམས་ཅན་རྣམས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་དགོད་པར་བྱའོ།
en: I should establish beings in the fruit of entering the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: I should establish them in the fruit of being destined for only one more rebirth, {Ki.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་རང་བྱང་ཆུབ་ལ་རབ་ཏུ་དགོད་པར་བྱའོ།
en: IV: 154} in the fruit of no longer being subject to rebirth, and in arhatship and individual enlightenment.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་དགོད་པར་བྱའོ། །སྙམ་དུ་སེམས་བསྐྱེད་ཅིང་།
en: I should establish them in unsurpassed, complete enlightenment.’ “

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ཆོས་དེ་དག་ཐོས་ནས་སེམས་བརྟེན་པར་བྱའོ།
en: In this regard, bodhisattva great beings, from the time when they first begin to set their mind on enlightenment, should be steadfast when they listen to such things.

source: །སེམས་མི་གཡོ་བར་བྱའོ།
en: Their minds should not be distracted.

source: །སེམས་མི་འཕྲོགས་པར་བྱའོ། །དེ་སེམས་བརྟེན་པ་དང་།
en: Their minds should not be carried away.

source: སེམས་མི་གཡོ་བ་དང་། སེམས་མི་འཕྲོགས་པ་དང་ལྡན་པས། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ན། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པར་འགྱུར་རོ།
en: If those whose minds are steadfast, undistracted, and not carried away practice the six perfections, they will enter upon the maturity of the bodhisattvas.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སླར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཕྱིར་ལྡོག་པ་ཞེས་བགྱིའམ། འོན་ཏམ་སླར་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱིར་མི་ལྡོག་པ་ཞེས་བགྱི།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, can irreversible bodhisattva great beings be called reversible, or can reversible bodhisattvas be called irreversible?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱིར་ལྡོག་པ་ཞེས་བྱའོ།
en: Subhūti, irreversible bodhisattvas may be called reversible, and reversible bodhisattvas may be called irreversible,” replied the Blessed One. “

source: །ཕྱིར་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་སླར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱིར་ལྡོག་པ་ཞེས་བགྱི། ཅིའི་སླད་དུ་སླར་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱིར་མི་ལྡོག་པ་ཞེས་བགྱི།
en: Blessed Lord, how may irreversible bodhisattvas be called reversible, and how may reversible bodhisattvas be called irreversible?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཕྱིར་ལྡོག་པ་དེ་ནི། རབ་འབྱོར་ཕྱིར་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་ཏེ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings who have turned away from the level of the śrāvakas or the level of the pratyekabuddhas are reversible bodhisattvas [in that they turn away from those levels], but they may be called irreversible bodhisattvas.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཕྱིར་མི་ལྡོག་པ་དེ་ནི། རབ་འབྱོར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་ཏེ། དེ་ནི་ཕྱིར་ལྡོག་པ་ཞེས་བྱའོ།
en: Subhūti, bodhisattva great beings who have not turned away from the level of the śrāvakas or the level of the pratyekabuddhas are irreversible bodhisattvas [in that they do not turn away from them], but they may be called reversible.

source: །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དུ་རིག་པར་བྱ་སྟེ།
en: Subhūti, you should know that bodhisattva great beings are defined as irreversible due to these attributes, indications, and signs.

source: རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བདུད་སྡིག་ཏོ་ཅན་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་བཟློག་པར་མི་ནུས་སོ།
en: Bodhisattva great beings who possess those attributes, indications, and signs cannot be turned away from unsurpassed, complete enlightenment by the evil Māra. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདོད་ན། བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་གོ། །བསམ་གཏན་གཉིས་པ་དང་གསུམ་པ་དང་། བཞི་པ་ལ་སྙོམས་པར་འཇུག་གོ།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible become absorbed at will in the first meditative concentration, and they become absorbed in the second, third, and fourth meditative concentrations.

source: །འགོག་པའི་བར་ལ་སྙོམས་པར་འཇུག་གོ།
en: They become absorbed in [the formless absorptions], up to and including cessation [of perceptions and feelings]. {

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདོད་ན།
en: Ki.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་སྙོམས་པར་འཇུག་གོ། །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྙོམས་པར་འཇུག་གོ།
en: IV: 155} “Moreover, Subhūti, bodhisattva great beings who are irreversible become absorbed at will in the four applications of mindfulness, and they become absorbed in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་གོ་མངོན་པར་ཤེས་པ་ལྔ་མངོན་པར་སྒྲུབ་བོ།
en: They become absorbed in the meditative stabilities of emptiness, signlessness, and wishlessness. They actualize the five extrasensory powers.

source: །དེ་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་པོ་དེ་དག་གིས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་འདྲིས་པར་བྱེད། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་གོམས་པར་བྱེད།
en: Through these four meditative concentrations, the four immeasurable attitudes, and four formless absorptions, they become acquainted with the absorption of cessation.

source: ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་གོམས་པར་བྱེད།
en: They investigate the applications of mindfulness, and they investigate the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་ཡང་སྙོམས་པར་འཇུག་སྟེ།
en: They are then reabsorbed in the meditative stabilities of emptiness, signlessness, and wishlessness, but they do not acquire the fruits of meditative concentration.

source: བསམ་གཏན་གྱི་འབྲས་བུ་ཡོངས་སུ་མི་འཛིན་ཏོ། །ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: They do not acquire the fruits of the immeasurable attitudes or the formless absorptions.

source: འགོག་པའི་སྙོམས་པར་འཇུག་པའི་འབྲས་བུ་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: They do not acquire the fruit of entering the stream to nirvāṇa.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཡོངས་སུ་མི་འཛིན་ཏོ། །ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: They do not acquire the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or arhatship.

source: །རང་བྱང་ཆུབ་ཐོབ་པར་མི་བྱེད་དོ།
en: They do not attain enlightenment.

source: །དེ་འདོད་ན་ཆེད་དུ་བསམས་ཤིང་ལུས་ཡོངས་སུ་འཛིན་ཏེ། ལུས་གང་གིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱ་བར་འགྱུར་བ། དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་འཛིན་ཏོ། །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་།
en: At will, they may acquire the bodily forms that they wish, and through those bodily forms, they act for the benefit of beings.

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱང་ཆུབ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་ཏེ།
en: Moreover, Subhūti, bodhisattva great beings who are irreversible are endowed with attention to enlightenment.

source: བྱང་ཆུབ་ཀྱི་སེམས་དང་མི་འབྲལ་ཞིང་གཟུགས་ལྷུར་ལེན་པ་མ་ཡིན།
en: They are not separated from enlightened mind, and they do not attach importance to physical forms.

source: མཚན་མ་ལྷུར་ལེན་པ་མ་ཡིན་ལུས་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to signs. They do not attach importance to the physical body.

source: སྦྱིན་པ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to generosity.

source: ཚུལ་ཁྲིམས་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to ethical discipline.

source: བཟོད་པ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to tolerance.

source: བརྩོན་འགྲུས་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to perseverance.

source: བསམ་གཏན་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to meditative concentration.

source: ཤེས་རབ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to wisdom.

source: ནང་སྟོང་པ་ཉིད་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to the emptiness of internal phenomena.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལྷུར་ལེན་པ་མ་ཡིན། འཕགས་པའི་བདེན་པ་དང་།
en: They do not attach importance to the thirty-seven factors conducive to enlightenment.
